[Killed] BlockStatement
src/lib/health-calc.ts:3:60
 import { UserProfile } from '@repo/shared/schemas'
 
-export function calculateBMR(profile: UserProfile): number {
-  const s = profile.gender === 'male' ? 5 : -161
-  const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
-  return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
-}
+export function calculateBMR(profile: UserProfile): number {}
 
 export function calculateTDEE(bmr: number, activityLevel: UserProfile['activityLevel']): number {
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: 867891806, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/health-calc.ts:4:13
 import { UserProfile } from '@repo/shared/schemas'
 
 export function calculateBMR(profile: UserProfile): number {
-  const s = profile.gender === 'male' ? 5 : -161
+  const s = false ? 5 : -161
   const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
   return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
killedBy: Health Calc Engine calculates BMR correctly (Mifflin-St Jeor)
statusReason: expected 1614 to be 1780 // Object.is equality

[Killed] EqualityOperator
src/lib/health-calc.ts:4:13
 import { UserProfile } from '@repo/shared/schemas'
 
 export function calculateBMR(profile: UserProfile): number {
-  const s = profile.gender === 'male' ? 5 : -161
+  const s = profile.gender !== 'male' ? 5 : -161
   const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
   return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
killedBy: Health Calc Engine calculates BMR correctly (Mifflin-St Jeor)
statusReason: expected 1614 to be 1780 // Object.is equality

[Killed] ArithmeticOperator
src/lib/health-calc.ts:5:61
 
 export function calculateBMR(profile: UserProfile): number {
   const s = profile.gender === 'male' ? 5 : -161
-  const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
+  const bmr = 10 * profile.weight + 6.25 * profile.height - 5 / profile.age + s
   return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
 }
killedBy: Health Calc Engine calculates BMR correctly (Mifflin-St Jeor)
statusReason: expected 1930 to be 1780 // Object.is equality

[Killed] ArithmeticOperator
src/lib/health-calc.ts:5:15
 
 export function calculateBMR(profile: UserProfile): number {
   const s = profile.gender === 'male' ? 5 : -161
-  const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
+  const bmr = 10 * profile.weight - 6.25 * profile.height - 5 * profile.age + s
   return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
 }
killedBy: Health Calc Engine calculates BMR correctly (Mifflin-St Jeor)
statusReason: expected +0 to be 1780 // Object.is equality

[Killed] EqualityOperator
src/lib/health-calc.ts:6:21
 export function calculateBMR(profile: UserProfile): number {
   const s = profile.gender === 'male' ? 5 : -161
   const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
-  return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
+  return Math.round(bmr <= 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
 }
 
killedBy: Health Calc Engine calculates BMR correctly (Mifflin-St Jeor)
statusReason: expected +0 to be 1780 // Object.is equality

[Killed] ConditionalExpression
src/lib/health-calc.ts:6:21
 export function calculateBMR(profile: UserProfile): number {
   const s = profile.gender === 'male' ? 5 : -161
   const bmr = 10 * profile.weight + 6.25 * profile.height - 5 * profile.age + s
-  return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
+  return Math.round(false ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
 }
 
killedBy: Health Calc Engine calculates BMR correctly (Mifflin-St Jeor)
statusReason: expected +0 to be 1780 // Object.is equality

[Killed] BlockStatement
src/lib/health-calc.ts:9:97
   return Math.round(bmr > 0 ? bmr : 0) // Ensure BMR never goes negative (though formula unlikely to)
 }
 
-export function calculateTDEE(bmr: number, activityLevel: UserProfile['activityLevel']): number {
-  const multipliers: Record<UserProfile['activityLevel'], number> = {
-    sedentary: 1.2,
-    light: 1.375,
-    moderate: 1.55,
-    heavy: 1.725,
-    athlete: 1.9,
-  }
-  return Math.round(bmr * multipliers[activityLevel])
-}
+export function calculateTDEE(bmr: number, activityLevel: UserProfile['activityLevel']): number {}
 
 export function calculateTargetCalories(tdee: number, goal: UserProfile['goal']): number {
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: 1247498393, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
src/lib/health-calc.ts:10:69
 }
 
 export function calculateTDEE(bmr: number, activityLevel: UserProfile['activityLevel']): number {
-  const multipliers: Record<UserProfile['activityLevel'], number> = {
-    sedentary: 1.2,
-    light: 1.375,
-    moderate: 1.55,
-    heavy: 1.725,
-    athlete: 1.9,
-  }
+  const multipliers: Record<UserProfile['activityLevel'], number> = {}
   return Math.round(bmr * multipliers[activityLevel])
 }
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: 698420854, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArithmeticOperator
src/lib/health-calc.ts:17:21
     heavy: 1.725,
     athlete: 1.9,
   }
-  return Math.round(bmr * multipliers[activityLevel])
+  return Math.round(bmr / multipliers[activityLevel])
 }
 

[Killed] BlockStatement
src/lib/health-calc.ts:20:90
   return Math.round(bmr * multipliers[activityLevel])
 }
 
-export function calculateTargetCalories(tdee: number, goal: UserProfile['goal']): number {
-  let target = tdee
-  
-  switch (goal) {
-    case 'lose_weight':
-      target = tdee - 500
-      break
-    case 'gain_muscle':
-      target = tdee + 300
-      break
-    case 'maintain':
-    default:
-      target = tdee
-  }
-
-  // VERIFIED SCIENCE: Safety Floor.
-  // 1. Never return negative calories.
-  // 2. Ideally, never drop below BMR significantly without medical supervision.
-  // For this property test, we simply ensure it's at least 1000kcal or the TDEE if extremely low.
-  // This prevents the "Negative Calories" bug caught by fast-check.
-  return Math.max(1000, Math.round(target))
-}
+export function calculateTargetCalories(tdee: number, goal: UserProfile['goal']): number {}
 
 // NEW: Advanced Macro Logic based on Archetype
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: -426827771, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/lib/health-calc.ts:24:5
   let target = tdee
   
   switch (goal) {
-    case 'lose_weight':
-      target = tdee - 500
-      break
+    case 'lose_weight':
     case 'gain_muscle':
       target = tdee + 300

[Survived] ArithmeticOperator
src/lib/health-calc.ts:25:16
   
   switch (goal) {
     case 'lose_weight':
-      target = tdee - 500
+      target = tdee + 500
       break
     case 'gain_muscle':

[Survived] ConditionalExpression
src/lib/health-calc.ts:27:5
     case 'lose_weight':
       target = tdee - 500
       break
-    case 'gain_muscle':
-      target = tdee + 300
-      break
+    case 'gain_muscle':
     case 'maintain':
     default:

[Survived] StringLiteral
src/lib/health-calc.ts:27:10
     case 'lose_weight':
       target = tdee - 500
       break
-    case 'gain_muscle':
+    case "":
       target = tdee + 300
       break

[Survived] ArithmeticOperator
src/lib/health-calc.ts:28:16
       target = tdee - 500
       break
     case 'gain_muscle':
-      target = tdee + 300
+      target = tdee - 300
       break
     case 'maintain':

[Survived] StringLiteral
src/lib/health-calc.ts:30:10
     case 'gain_muscle':
       target = tdee + 300
       break
-    case 'maintain':
+    case "":
     default:
       target = tdee

[Survived] ConditionalExpression
src/lib/health-calc.ts:31:5
       target = tdee + 300
       break
     case 'maintain':
-    default:
-      target = tdee
+    default:
   }
 

[Survived] MethodExpression
src/lib/health-calc.ts:40:10
   // 2. Ideally, never drop below BMR significantly without medical supervision.
   // For this property test, we simply ensure it's at least 1000kcal or the TDEE if extremely low.
   // This prevents the "Negative Calories" bug caught by fast-check.
-  return Math.max(1000, Math.round(target))
+  return Math.min(1000, Math.round(target))
 }
 

[Killed] ConditionalExpression
src/lib/health-calc.ts:50:5
 
   // Adjust ratios based on Archetype
   switch (profile.archetype) {
-    case 'bodybuilder':
-      proteinPerKg = 2.2 // High protein for hypertrophy
-      fatPerKg = 0.7 // Lower fat to allow for carbs
-      break
+    case 'bodybuilder':
     case 'fighter':
     case 'crossfitter':
killedBy: Health Calc Engine (Property Based) should ensure protein requirements are met regardless of caloric deficit
statusReason: Property failed after 2 tests
{ seed: -2063077175, path: "1:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/lib/health-calc.ts:54:10
       proteinPerKg = 2.2 // High protein for hypertrophy
       fatPerKg = 0.7 // Lower fat to allow for carbs
       break
-    case 'fighter':
+    case "":
     case 'crossfitter':
       proteinPerKg = 2.0 // High protein
killedBy: Health Calc Engine (Property Based) should ensure protein requirements are met regardless of caloric deficit
statusReason: Property failed after 3 tests
{ seed: -1954808073, path: "2:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"fighter","dietaryPreference":"standard"}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/health-calc.ts:55:5
       fatPerKg = 0.7 // Lower fat to allow for carbs
       break
     case 'fighter':
-    case 'crossfitter':
-      proteinPerKg = 2.0 // High protein
-      fatPerKg = 0.8 // Moderate fat
-      // These athletes need MORE carbs, which naturally happens
-      // because protein/fat are fixed, leaving the rest for carbs.
-      break
+    case 'crossfitter':
     case 'senior':
       proteinPerKg = 1.6 // Moderate-High to prevent sarcopenia
killedBy: Health Calc Engine (Property Based) should ensure protein requirements are met regardless of caloric deficit
statusReason: Property failed after 1 tests
{ seed: 1918965712, path: "0:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"fighter","dietaryPreference":"standard"}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/lib/health-calc.ts:55:10
       fatPerKg = 0.7 // Lower fat to allow for carbs
       break
     case 'fighter':
-    case 'crossfitter':
+    case "":
       proteinPerKg = 2.0 // High protein
       fatPerKg = 0.8 // Moderate fat
killedBy: Health Calc Engine (Property Based) should ensure protein requirements are met regardless of caloric deficit
statusReason: Property failed after 5 tests
{ seed: -1995579102, path: "4:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"crossfitter","dietaryPreference":"standard"}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/health-calc.ts:61:5
       // These athletes need MORE carbs, which naturally happens
       // because protein/fat are fixed, leaving the rest for carbs.
       break
-    case 'senior':
-      proteinPerKg = 1.6 // Moderate-High to prevent sarcopenia
-      fatPerKg = 0.9 // Higher fat for hormonal health
-      break
+    case 'senior':
     case 'general':
     default:
killedBy: Health Calc Engine (Property Based) should ensure protein requirements are met regardless of caloric deficit
statusReason: Property failed after 1 tests
{ seed: -1912081059, path: "0:0:0:0:0:1", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"senior","dietaryPreference":"standard"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/lib/health-calc.ts:66:5
       fatPerKg = 0.9 // Higher fat for hormonal health
       break
     case 'general':
-    default:
-      proteinPerKg = 1.8
-      fatPerKg = 0.9
-      break
+    default:
   }
 

[Killed] ArithmeticOperator
src/lib/health-calc.ts:72:35
       break
   }
 
-  const proteinGrams = Math.round(profile.weight * proteinPerKg)
+  const proteinGrams = Math.round(profile.weight / proteinPerKg)
   const fatGrams = Math.round(profile.weight * fatPerKg)
 
killedBy: Health Calc Engine (Property Based) should ensure protein requirements are met regardless of caloric deficit
statusReason: Property failed after 1 tests
{ seed: 1019690340, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArithmeticOperator
src/lib/health-calc.ts:73:31
   }
 
   const proteinGrams = Math.round(profile.weight * proteinPerKg)
-  const fatGrams = Math.round(profile.weight * fatPerKg)
+  const fatGrams = Math.round(profile.weight / fatPerKg)
 
   // Calorie math: Protein=4, Fat=9, Carb=4

[Survived] ArithmeticOperator
src/lib/health-calc.ts:76:31
   const fatGrams = Math.round(profile.weight * fatPerKg)
 
   // Calorie math: Protein=4, Fat=9, Carb=4
-  const caloriesFromProtein = proteinGrams * 4
+  const caloriesFromProtein = proteinGrams / 4
   const caloriesFromFat = fatGrams * 9
 

[Survived] ArithmeticOperator
src/lib/health-calc.ts:77:27
 
   // Calorie math: Protein=4, Fat=9, Carb=4
   const caloriesFromProtein = proteinGrams * 4
-  const caloriesFromFat = fatGrams * 9
+  const caloriesFromFat = fatGrams / 9
 
   // Remaining calories go to Carbs (Energy)

[Killed] MethodExpression
src/lib/health-calc.ts:81:29
 
   // Remaining calories go to Carbs (Energy)
   // Safety: Math.max(0) ensures we don't return negative carbs if Protein+Fat > Target
-  const remainingCalories = Math.max(0, targetCalories - (caloriesFromProtein + caloriesFromFat))
+  const remainingCalories = Math.min(0, targetCalories - (caloriesFromProtein + caloriesFromFat))
   const carbGrams = Math.round(remainingCalories / 4)
 
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: -1249469626, path: "0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArithmeticOperator
src/lib/health-calc.ts:81:41
 
   // Remaining calories go to Carbs (Energy)
   // Safety: Math.max(0) ensures we don't return negative carbs if Protein+Fat > Target
-  const remainingCalories = Math.max(0, targetCalories - (caloriesFromProtein + caloriesFromFat))
+  const remainingCalories = Math.max(0, targetCalories + (caloriesFromProtein + caloriesFromFat))
   const carbGrams = Math.round(remainingCalories / 4)
 

[Survived] ArithmeticOperator
src/lib/health-calc.ts:82:32
   // Remaining calories go to Carbs (Energy)
   // Safety: Math.max(0) ensures we don't return negative carbs if Protein+Fat > Target
   const remainingCalories = Math.max(0, targetCalories - (caloriesFromProtein + caloriesFromFat))
-  const carbGrams = Math.round(remainingCalories / 4)
+  const carbGrams = Math.round(remainingCalories * 4)
 
   // Recalculate total calories based on actual macros to ensure consistency

[Killed] ArithmeticOperator
src/lib/health-calc.ts:86:64
 
   // Recalculate total calories based on actual macros to ensure consistency
   // (In case target was too low to support essential Protein/Fat)
-  const finalCalories = (proteinGrams * 4) + (fatGrams * 9) + (carbGrams * 4)
+  const finalCalories = (proteinGrams * 4) + (fatGrams * 9) + (carbGrams / 4)
 
   return {
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: -1252099447, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/lib/health-calc.ts:86:47
 
   // Recalculate total calories based on actual macros to ensure consistency
   // (In case target was too low to support essential Protein/Fat)
-  const finalCalories = (proteinGrams * 4) + (fatGrams * 9) + (carbGrams * 4)
+  const finalCalories = (proteinGrams * 4) + (fatGrams / 9) + (carbGrams * 4)
 
   return {
killedBy: Health Calc Engine (Property Based) should never return NaN, Infinity, or Negative numbers for any valid profile
statusReason: Property failed after 1 tests
{ seed: -1282155785, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"gender":"male","age":13,"height":50,"weight":20,"activityLevel":"sedentary","goal":"lose_weight","archetype":"bodybuilder","dietaryPreference":"standard"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
